Revit 2023 API
SingleServerService.UnsetActiveServer Method
 Unset the active server for the particular document.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2013
Syntax
C#
public void UnsetActiveServer(
	Document document
)
Visual Basic
Public Sub UnsetActiveServer ( _
	document As Document _
)
Visual C++
public:
void UnsetActiveServer(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
Remarks
 After unsetting the active server, the document will be using the application-wide active server, if one was already set.
 Note it is not possible to unset a server that acts as an application-wide active server for a service. On the other hand, there should be no reason to ever do so, for each and every registered service should have (ideally) an active server set applicatiton-wide.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The operation is not allowed because the service is being executed.
See Also
SingleServerService Class
Autodesk.Revit.DB.ExternalService Namespace